Meshes & Solutions/polygon-16/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       22080;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       22160;
    }
    polygon
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          160;
        startFace       22240;
    }
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          11200;
        startFace       22400;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          11200;
        startFace       33600;
    }
    outside
    {
        type            patch;
        nFaces          320;
        startFace       44800;
    }
)

// ************************************************************************* //
