Meshes & Solutions/polygon-16/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

forceCoeffs
{
    type            forceCoeffs;

    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    // specify the patches on which to compute forces
    patches         (polygon);

    // forces
    liftDir         (0 1 0);    // Lift direction, y
    dragDir         (1 0 0);    // Drag direction, x

    // moments
    CofR            (0 0 0);    // Centre of rotation for moment calculations 
    pitchAxis       (0 0 1);    // Pitch axis, z

    // references
    magUInf         1.0;        // reference velocity
    lRef            1.0;        // reference length for moment 
    Aref            0.1;        // reference area (frontal area of circular cylinder -- recall diameter is 1 and z-span is 0.05*2 = 0.1)

    // do not change
    rho             rhoInf;     // Incompressible
    rhoInf          1.0;        // Incompressible

}


// ************************************************************************* //
